Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: If a and b are incomparable, and b and c are incomparable, then a and c are also incomparable.
ja: aとbが比較できないならば、そしてbとcが比較できないならば、そのときaとcもまた比較できない。

source: If element is not found in the collection, returns nil.
ja: elementがコレクションの中に見つけられないならば、nilを返します。

source: If element is not found in the collection, this method returns nil.
ja: elementがコレクションの中に見つけられないならば、このメソッドはnilを返します。

source: If distance is positive, this is the same value as the result of distance calls to index(after:).
ja: distanceが正ならば、これはdistanceでindex(after:)を呼び出すの結果と同じ値です。

source: If endAngle - startAngle < 2π, the gradient fills the missing area with the colors defined by gradient locations one and zero, transitioning between the two halfway across the missing area.
ja: endAngle - startAngle < 2πならば、勾配はその欠けている領域を勾配位置１とゼロによって定義される色で、欠けている領域を横切って２つの中途の間を推移しながら、満たします。

source: If true, only nonempty subsequences are returned.
ja: trueならば、空でない下位シーケンスだけが返されます。

source: If possiblePrefix has no elements, the return value is true.
ja: possiblePrefixが１つも要素を持たないならば、戻り値はtrueです。

source: If a maximum constraint is specified and the size proposed for the frame by the parent is greater than the size of this view, the proposed size, clamped to that maximum.
ja: 最大限制約が指定されるそして親によってフレームに対して提案されるサイズがこのビューのサイズ、提案されるサイズ、よりも大きいならば、その最大限までに留められます。

source: If a minimum constraint is specified and the size proposed for the frame by the parent is less than the size of this view, the proposed size, clamped to that minimum.
ja: 最小限制約が指定されるそして親によってフレームに対して提案されるサイズがこのビューのサイズ、提案されるサイズ、よりも小さいならば、その最小限までに留められます。

source: If a value transformer designates that its transformation is reversible by returning true for allowsReverseTransformation(), you can also use the reverseTransformedValue(_:) to perform the transformation in reverse.
ja: ある値変換器がそれの変換が元に戻せることをtrueをallowsReverseTransformation()に対して返すことによって示すならば、あなたはまたreverseTransformedValue(_:)を使って逆での変換を実行してください。

source: If an element equal to newMember was already contained in the set, the method returns (false, oldMember), where oldMember is the element that was equal to newMember.
ja: newMemberに等しい要素が既に集合に含まれたならば、メソッドは(false, oldMember)を返します、ここでoldMemberはnewMemberに等しかった要素です。

source: If an explicit value hasn’t been set, SwiftUI uses the default system accent color.
ja: ある明示的値が設定されていないならば、SwiftUIは省略時のシステムアクセントカラーを使います。

source: If both constraints are specified in a dimension, the frame unconditionally adopts the size proposed for it, clamped to the constraints.
ja: 両方の制約がある次元において指定されるならば、フレームは無条件に、それら制約までに留められる、それに対して提案されるサイズを採用します。

source: If inserting a view in the same transaction that another view with the same key is removed, the system will interpolate their frame rectangles in window space to make it appear that there is a single view moving from its old position to its new position.
ja: あるビューを同じキーをもつ別のビューが取り除かれるのと同じ遷移において挿入するならば、システムはウインドウ空間の中のそれらフレーム矩形を改ざんして、それの古い位置からそれの新しい位置へと移動している単一のビューがあるように見せかけます。

source: If multiple views publish bindings using the same key, the wrapped property will reflect the value of the binding from the view closest to focus.
ja: 複数のビューがバインディングそれらを同じキーで出版するならば、ラップされたプロパティは、フォーカスに最も近いビューからのバインディングの値を反映するでしょう。

source: If no elements in the collection satisfy the given predicate, returns nil.
ja: コレクションの要素が与えられた述部を満たすことがないならば、nilを返します。

source: If no minimum or maximum constraint is specified in a given dimension, the frame adopts the sizing behavior of its child in that dimension.
ja: 最小限または最大限制約がある与えられた次元において指定されないならば、フレームはそれの子のサイズ指定挙動をその次元において採用します。

source: If no such storage exists, it is first created.
ja: そのようなストレージが存在しないならば、それがまず作成されます。

source: If the UndoManager is nil, the environment represents a context where undo and redo isn’t supported, and you can skip undo registrations.
ja: UndoManagerがnilであるならば、環境はあるコンテキストを表します、そこでアンドゥとリドゥはサポートされません、そしてあなたはアンドゥ登録を省けます。

source: If the id of a data element changes, the content view generated from that data element loses any current state and animations.
ja: あるデータ要素のidが変化するならば、そのデータ要素から生成されたコンテンツビューは、あらゆる現在の状態とアニメーションを失います。

source: If the NSTask object gets released, however, this notification will not get sent, as the port the message would have been sent on was released as part of the task release.
ja: NSTaskオブジェクトが解放されたならば、しかしながら、この通知は送られないでしょう、メッセージが送られたかもしれないポートが、タスク解放の一部として解放されたので。

source: If the NSKeyValueObservingOptionPrior option was specified when the observer was registered this notification is sent prior to a change.
ja: NSKeyValueObservingOptionPriorオプションがそのオブザーバが登録された時に指定されたならば、この通知は変更に先立って送信されます。

source: If the prior option was specified when the observer was registered this notification is sent prior to a change.
ja: priorオプションがそのオブザーバが登録された時に指定されたならば、この通知は変更に先立って送信されます。

source: If the `id` of a data element changes, then the content view generated from that data element will lose any current state and animations.
ja: あるデータ要素の `id` が変化するならば、そのときそのデータ要素から生成されたコンテンツビューは、あらゆる現在の状態とアニメーションを失うでしょう。

source: If the base value is nil, this initializer returns nil.
ja: 基本値がnilならば、このイニシャライザはnilを返します。

source: If the collection does not support an internal representation in a form of contiguous storage, body is not called and nil is returned.
ja: コレクションが内部表現を隣接ストレージの形式においてサポートしないならば、bodyは呼び出されません、そしてnilが返されます。

source: If the collection is empty, the method returns nil.
ja: コレクションが空ならば、このメソッドはnilを返します。

source: If the collection is empty, the value of this property is nil.
ja: コレクションが空であるならば、このプロパティはnilです。

source: If the drag and drop operation doesn’t contain any of the supported types, then this drop destination doesn’t activate and isTargeted doesn’t update.
ja: ドラッグ＆ドロップ操作がこのサポートされる型のどれも含まないならば、その時このドロップ目的地は活動的になりません、そしてisTargetedは更新しません。

source: If the identity changes, the system dismisses a currently-presented action sheet and replace it with a new one.
ja: 同一性が変化するならば、システムは現在提示されるアクションシートを退けて、それを新しいものと置き換えます。

source: If the identity changes, the system dismisses a currently-presented alert and replace it by a new alert.
ja: 同一性が変化するならば、システムは現在提示されるアラートを退けて、それを新しいアラートによって置き換えます。

source: If the identity changes, the system dismisses a currently-presented popover and replace it by a new popover.
ja: 同一性が変化するならば、システムは現在提示されるアラートを退けて、それを新しいポップオーバーによって置き換えます。

source: If the identity changes, the system dismisses a currently-presented sheet and replaces it with a new sheet.
ja: 同一性が変化するならば、システムは現在提示されるシートを退けて、それを新しいシートと置き換えます。

source: If the identity of item changes, the system will dismiss a currently-presented modal view and replace it by a new modal view.
ja: itemの同一性が変化するならば、システムは現在提示されるモーダルビューを退けて、それを新しいモーダルビューによって置き換えるでしょう。

source: If the initializer can’t find the key in the table, or if no table exists, the text view displays the string representation of the key instead.
ja: イニシャライザがキーをテーブルの中で見つけられないならば、またはテーブルが存在しないならば、テキストビューはキーの文字列表現を代わりに表示します。

source: If the maximum length exceeds the number of elements in the collection, the result contains all the elements in the collection.
ja: 最大長がコレクションの要素の数を超えるならば、結果はコレクションの要素すべてを含みます。

source: If the maximum length exceeds the number of elements in the collection, the result contains the entire collection.
ja: 最大長がコレクションの要素の数を超えるならば、結果はコレクション全体を含みます。

source: If the number of currently-inserted views in the group with isSource = true is not exactly one results are undefined, due to it not being clear which is the source view.
ja: グループの中にisSource = trueで現在挿入されるビューの数が正確に１つでないならば結果は未定義です、どれがソースビューであるかはっきりしないせいで。

source: If the number of elements to drop exceeds the number of elements in the collection, the result is an empty subsequence.
ja: 省かれることになる要素の数がコレクションの要素の数を超えるならば、結果は空の下位シーケンスになります。

source: If the pointer is in the view’s frame, the action closure passes true as a parameter; otherwise, false.
ja: ポインタがビューのもつフレームの中にあるならば、actionクロージャはtrueをバラメータとして渡します；そうでなければ、false。

source: If the preview provider returns nil for this property, Xcode infers the platform based on the file in which the PreviewProvider is defined.
ja: プレビュープロバイダは、nilをこのプロパティに対して返します、Xcodeはプラットホームを、それにおいてPreviewProviderが定義されたファイルに基づいて推論します。

source: If the sequence has no elements, nextPartialResult is never executed and initialResult is the result of the call to reduce(_:_:).
ja: シーケンスが１つも要素を持たないならば、nextPartialResultは決して実行されません、そしてinitialResultはreduce(_:_:)への呼び出しの結果となります。

source: If the sequence has no elements, updateAccumulatingResult is never executed and initialResult is the result of the call to reduce(into:_:).
ja: シーケンスが１つも要素を持たないならば、updateAccumulatingResultは決して実行されません、そしてinitialResultはreduce(into:_:)への呼び出しの結果となります。

source: If the sequence has no elements, returns nil.
ja: シーケンスが要素を持たないならば、nilを返します。

source: If the sequence has no elements, the result is initialResult.
ja: シーケンスが１つも要素を持たないならば、結果はinitialResultです。

source: If the value is nil, the text uses as many lines as required.
ja: 値がnilならば、テキストは要求されるだけ多くの行を使います。

source: If the value of the NSKeyValueChangeKindKey entry is NSKeyValueChangeInsertion, NSKeyValueChangeRemoval, or NSKeyValueChangeReplacement, the value of this key is an NSIndexSet object that contains the indexes of the inserted, removed, or replaced objects.
ja: NSKeyValueChangeKindKey登録項目の値がNSKeyValueChangeInsertion、NSKeyValueChangeRemoval、またはNSKeyValueChangeReplacementであるならば、このキーの値はあるNSIndexSetオブジェクトで、それは挿入、除去、または置換されたオブジェクトのインデックスを含みます。

source: If the value of the NSKeyValueChangeKindKey entry is NSKeyValueChangeSetting, and NSKeyValueObservingOptionNew was specified when the observer was registered, the value of this key is the new value for the attribute.
ja: NSKeyValueChangeKindKey登録項目の値がNSKeyValueChangeSettingである、そしてNSKeyValueObservingOptionNewがそのオブザーバが登録された時に指定されたならば、このキーの値はその属性に対する新しい値です。

source: If the value of the NSKeyValueChangeKindKey entry is NSKeyValueChangeSetting, and NSKeyValueObservingOptionOld was specified when the observer was registered, the value of this key is the value before the attribute was changed.
ja: NSKeyValueChangeKindKey登録項目の値がNSKeyValueChangeSettingである、そしてNSKeyValueObservingOptionOldがそのオブザーバが登録された時に指定されたならば、このキーの値はその属性が変更される前の値です。

source: If the value of the kindKey entry is NSKeyValueChange.insertion, NSKeyValueChange.removal, or NSKeyValueChange.replacement, the value of this key is an NSIndexSet object that contains the indexes of the inserted, removed, or replaced objects.
ja: kindKey登録項目の値がNSKeyValueChange.insertion、NSKeyValueChange.removal、またはNSKeyValueChange.replacementであるならば、このキーの値はあるNSIndexSetオブジェクトで、それは挿入、除去、または置換されたオブジェクトのインデックスを含みます。

source: If the value of the kindKey entry is NSKeyValueChange.setting, and new was specified when the observer was registered, the value of this key is the new value for the attribute.
ja: kindKey登録項目の値がNSKeyValueChange.settingである、そしてnewがそのオブザーバが登録された時に指定されたならば、このキーの値はその属性に対する新しい値です。

source: If the value of the kindKey entry is NSKeyValueChange.setting, and old was specified when the observer was registered, the value of this key is the value before the attribute was changed.
ja: kindKey登録項目の値がNSKeyValueChange.settingである、そしてoldがそのオブザーバが登録された時に指定されたならば、このキーの値はその属性が変更される前の値です。

source: If the view accepts the proposal but the text doesn’t fit into the available space, the view uses a combination of wrapping, tightening, scaling, and truncation to make it fit.
ja: ビューはその提案を受け入れるがテキストがその利用可能な空きへと収まらないならば、ビューは、自動改行（ワードラップ）、締める、拡大縮小、そして切り詰めるの組み合わせを使ってそれを収まるようにします。

source: If the view can’t perform localization, it displays the key instead.
ja: ビューがローカライゼーションを実行できないならば、それはキーを代わりに表示します。

source: If there are any values that should be different for the process, for example, if the current directory should change, you must change the value before you launch it.
ja: 異なるべき何らかの値がそのプロセスに対してあるならば、例えば、現在のディレクトリが変わるべきならば、あなたはその値をあなたがそれを起動する前に変更しなければなりません。

source: If there are no pending changes, this method does nothing.
ja: 未解決の変更が無いならば、このメソッドは何もしません。

source: If this value is nil, the text uses as many lines as required.
ja: この値がnilならば、テキストは必要なだけ多くの行を使います。

source: If this view is resizable, the resulting view uses aspectRatio as its own aspect ratio.
ja: このビューが大きさ変更可能ならば、結果のビューはaspectRatioをそれのアスペクト比として使います。

source: If this view is resizable, the resulting view will have aspectRatio as its aspect ratio.
ja: このビューが大きさ変更可能ならば、結果のビューはaspectRatioをそれのアスペクト比として持つでしょう。

source: If this view is smaller than the resulting frame in either dimension, alignment specifies this view’s alignment within the frame.
ja: このビューがどちらかの次元において結果フレームより小さいならば、alignmentはこのフレーム内のこのビューのもつ調整を指定します。

source: If two objects are equal, they must have the same hash value, so if you override isEqual(_:), make sure you also override the hash property.
ja: ２つのオブジェクトが等しいならば、それらは同じハッシュ値を持たなければなりません、それであなたがisEqual(_:)をオーバーライドするならば、あなたはまたhashプロパティをオーバーライドすることを確実にしてください。

source: If you add a child node to an XMLElement object and that child already has a parent, XMLElement raises an exception; the child must be detached or copied first.
ja: あなたがある子ノードをXMLElementオブジェクトに加えるそしてその子が既に親を持つならば、XMLElementは例外を引き起こします；子は最初に分離またはコピーされなければなりません。

source: If you add a valid child node and that object already has a parent, XMLDocument raises an exception.
ja: あなたが有効な子ノードを加えてそのオブジェクトが既にある親を持つならば、XMLDocumentは例外を引き起こします。

source: If you add both the tracking(_:) and kerning(_:) modifiers to a view, the view applies the tracking and ignores the kerning.
ja: あなたがtracking(_:)とkerning(_:)修飾子を両方ともあるビューに加えるならば、そのビューはトラッキングを適用して、カーニングを無視します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison instead.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、代わりにString APIを使うべきです、それはローカライズされた比較を実行します。

source: If you are sorting strings to present to the end user, use String APIs that perform localized comparison.
ja: あなたが文字列をソートしてエンドユーザに提供するならば、String APIを使うべきです、それはローカライズされた比較を実行します。

source: If you attempt to add any other kind of child node to an XMLDocument object, such as an attribute, namespace, another document object, or an element other than the root, XMLDocument raises an exception.
ja: あなたが何か他の種類の子ノードをXMLDocumentオブジェクトに加えようと試みるならば、たとえば属性、名前空間、別の書類オブジェクト、またはルート以外のある要素など、 XMLDocumentは例外を引き起こします。

source: If you create a button directly on a blank canvas, the style varies by platform.
ja: あなたがボタンを直接にある空白キャンバス上で作成するならば、そのスタイルはプラットホームによって様々です。

source: If you create a button inside a container, like a List, the style resolves to the recommended style for buttons inside that container for that specific platform.
ja: あなたがボタンをあるコンテナ内部で作成するならば、Listのように、そのスタイルはその特定のプラットホームに対するそのコンテナ内部のボタンに推奨されるスタイルに解決します。

source: If you create a toggle directly on a blank canvas, the style varies:
ja: あなたがトグルを直接に空白キャンバス上で作成するならば、そのスタイルは以下のように様々です：

source: If you create a toggle inside a container, such as a List, the toggle automatically uses a style appropriate to the context.
ja: あなたがトグルをあるコンテナ、たとえばListリストなどの内部で作成するならば、トグルは自動的にその文脈に適切なスタイルを使います。

source: If you declare a property as an environment object, be sure to set a corresponding model object on an ancestor view by calling its environmentObject(_:) method.
ja: あなたがあるプロパティを環境オブジェクトとして宣言するならば、ある対応モデルオブジェクトを先祖ビュー上でそれのenvironmentObject(_:)メソッドを呼び出すことによって設定することを確実にしてください。

source: If you do not use a custom coordinator instance, the system provides a default instance.
ja: あなたがあつらえのコーディネータインスタンスを使わないならば、システムは省略時のインスタンスを提供します。

source: If you do not use a custom coordinator, the system provides a default instance.
ja: あなたがあつらえのコーディネータを使わないならば、システムは省略時のインスタンスを提供します。

source: If you do want to localize the value stored in a string variable, you can choose to call the init(_:tableName:bundle:comment:) initializer by first creating a LocalizedStringKey instance from the string variable:
ja: あなたが文字列変数の中に格納される値のローカライズを望むならば、あなたはinit(_:tableName:bundle:comment:)イニシャライザを呼び出すことを選べます、最初にLocalizedStringKeyインスタンスを文字列変数から作成することによって：

source: If you don't override this property, accessing the default implementation triggers an exception.
ja: あなたがこのプロパティをオーバーライドしないならば、省略時実装にアクセスすることは例外を引き起こします。

source: If you have a string literal that you don’t want to localize, use the init(verbatim:) initializer instead.
ja: あなたがローカライズを望まない文字列リテラルを持つならば、init(verbatim:)イニシャライザを代わりに使ってください。

source: If you haven’t provided localization for a particular string, you still get reasonable behavior, because the initializer displays the key, which typically contains the unlocalized string.
ja: あなたがローカライゼーションを特定の文字列に対して提供しなかったとしても、あなたは依然として理にかなった挙動を得ます、なぜならイニシャライザはキーを表示するからです、それは概してローカライズされない文字列を含みます。

source: If you initialize a text view with a string literal, the view uses the init(_:tableName:bundle:comment:) initializer, which interprets the string as a localization key and searches for the key in the table you specify, or in the default table if you don’t specify one.
ja: あなたがテキストビューをある文字列リテラルで初期化するならば、ビューはinit(_:tableName:bundle:comment:)イニシャライザを使います、それはその文字列をローカライゼーションキーとして解釈します、そしてそのキーをあなたが指定するテーブルにおいて、またはあなたがそれを指定しないならば省略時のテーブルにおいて検索します。

source: If you initialize a text view with a string variable rather than a string literal, the view triggers the init(_:) initializer instead, because it assumes that you don’t want localization in that case.
ja: あなたがあるテキストビューを文字列リテラルではなく文字列変数で初期化するならば、ビューはinit(_:)イニシャライザを代わりに引き起こします、なぜならそれはあなたがローカライゼーションをその場合には望まないと仮定するからです。

source: If you instead apply the border first, it outlines the text view, which never takes more space than it needs to render its contents.
ja: あなたが代わりに境界線を最初に適用するならば、それはテキストビューの輪郭を描きます、それは決してそれがそれの内容を描出するのに必要とするより多くの空間を取りません。

source: If you intialize a text view with a variable value, the view uses the init(_:) initializer, which doesn’t localize the string.
ja: あなたがあるテキストビューを変数値で初期化するならば、そのビューはinit(_:)イニシャライザを使います、それはその文字列をローカライズしません。

source: If you need a reversed collection of the same type, you may be able to use the collection’s sequence-based or collection-based initializer.
ja: あなたが同じ型での逆にされたコレクションを必要とするならば、あなたはコレクションのもつシーケンス基盤のまたはコレクション基盤のイニシャライザを使うことができるでしょう。

source: If you need finer control over the styling of the text, you can use the same modifier to configure a system font or choose a custom font.
ja: あなたがより優れた制御をテキストのスタイル指定に対して必要とするならば、あなたは同じ修飾子を使ってシステムフォントを構成設定するまたはあつらえのフォントを選ぶことが可能です。

source: If you need the old value, capture it in the closure.
ja: あなたが古い値を必要とするならば、それをクロージャの中でキャプチャしてください。

source: If you need to infer moves, call the inferringMoves() method on the resulting difference.
ja: あなたが移動を推論する必要があるならば、inferringMoves()メソッドを結果の差異の上で呼び出してください。

source: If you need to perform a long-running task in response to value changing, you should dispatch to a background queue.
ja: あなたが長く動作するタスクをvalueの変化に答えて実行する必要があるならば、あなたはあるバックグラウンドキューにディスパッチすべきです。

source: If you need to perform such tasks, dispatch to a background queue:
ja: あなたがそのようなタスクを実行する必要があるならば、あるバックグラウンドキューにディスパッチしてください：

source: If you only specify one of the dimensions, the resulting view assumes this view’s sizing behavior in the other dimension.
ja: あなたが次元の１つを指定するだけならば、結果ビューは、このビューのもつ大きさ決定挙動を他の次元において仮定されます。

source: If you override this method, you must call super at some point in your implementation.
ja: あなたがこのメソッドをオーバーライドするならば、あなたはsuperをあなたの実装の中のどこかの点で呼び出さなければなりません。

source: If you provide your own implementation, make sure to compute the value nondestructively.
ja: あなたがあなた独自の実装を提供するならば、値を非破壊的に計算することを確実にしてください。

source: If you set the preview device to nil, as it is by default, Xcode automatically chooses an appropriate device based on your target.
ja: あなたがプレビューデバイスをnilに設定するならば、初期状態でのように、Xcodeは自動的に適切なデバイスをあなたのターゲットに基づいて選びます。

source: If you specify nil, this method looks for the file in the main bundle.
ja: あなたがnilを指定するならば、このメソッドはファイルをメインバンドルの中で捜します。

source: If you specify nil, you must assign a valid view to the rootView property before accessing the view controller's view property.
ja: あなたがnilを指定するならば、あなたは有効なビューをrootViewプロパティに割り当てなければなりません、ビューコントローラのもつviewプロパティにアクセスする前に。

source: If you want a different standard of comparison, override isEqual:.
ja: あなたが比較の異なる標準を望むならば、isEqual:をオーバーライドしてください。

source: If you want to display a string variable, use the init(_:) initializer, which also bypasses localization.
ja: あなたが文字列変数を表示したいならば、init(_:)イニシャライザを使ってください、それはまたローカライゼーションを迂回します。

source: If you want to localize a string literal before displaying it, use the init(_:tableName:bundle:comment:) initializer instead.
ja: あなたがある文字列リテラルをそれを表示する前にローカライズしたいならば、init(_:tableName:bundle:comment:)イニシャライザを代わりに使ってください。

source: If you want to use the default Font.Weight (regular), you don't need to specify the weight in the method.
ja: あなたが省略時のFont.Weight（regular）を使いたいならば、あなたはweightをメソッドにおいて指定する必要はありません。

source: If your custom class has no direct NSXML counterpart—for example, it is a subclass of NSXMLNode that represents CDATA sections—then you can walk the tree after it has been created and insert the new node where appropriate.
ja: あなたのあつらえのクラスが直接のNSXML相当物を持たないならば — 例えば、それが、NSXMLNodeのサブクラスであり、CDATAセクションを表している — そのときあなたはツリーをそれが作成された後に歩いて行って（walk）、新しいノードを適切なところに挿入できます。

source: If your custom class has no direct NSXML counterpart—for example, it is a subclass of XMLNode that represents CDATA sections—then you can walk the tree after it has been created and insert the new node where appropriate.
ja: あなたのあつらえのクラスが直接のNSXML相当物を持たないならば — 例えば、それが、XMLNodeのサブクラスであり、CDATAセクションを表している — そのときあなたはツリーをそれが作成された後に歩いて行って（walk）、新しいノードを適切なところに挿入できます。

source: If your interface object doesn't interact with other parts of your app, providing a coordinator is unnecessary.
ja: あなたのインターフェイスオブジェクトがあなたのアプリの他の部分と相互作用しないならば、コーディネータを提供することは不必要です。

source: If your view controller doesn't interact with other parts of your app, providing a coordinator is unnecessary.
ja: あなたのビューコントローラがあなたのアプリの他の部分と相互作用しないならば、コーディネータを提供することは不必要です。

source: If your view doesn't interact with other parts of your app, providing a coordinator is unnecessary.
ja: あなたのビューがあなたのアプリの他の部分と相互作用しないならば、コーディネータを提供することは不必要です。

source: If your view doesn't interact with other parts of your app, you don't have to provide a coordinator.
ja: あなたのビューがあなたのアプリの他の部分と相互作用しないならば、あなたはコーディネータを提供する必要はありません。

source: If you’re passing a generator that results in the same sequence of elements each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行する度ごとに同じシーケンスの要素それらという結果になるある生成子を渡しているならば、そのシーケンスはあなたのプログラムが異なるバージョンのSwiftを使ってコンパイルされる時に変化するかもしれません。

source: If you’re passing a generator that results in the same shuffled order each time you run your program, that sequence may change when your program is compiled using a different version of Swift.
ja: あなたがあなたのプログラムを実行する度ごとに同じシャッフルされた順番という結果になるある生成子を渡しているならば、そのシーケンスはあなたのプログラムが異なるバージョンのSwiftを使ってコンパイルされる時に変化するかもしれません。

source: Implement the required body computed property to provide the content for your custom view.
ja: 必須のbody計算プロパティを実装することで、あなたのあつらえのビューに対する内容を提供してください。

source: Implement this method if changes to your interface object might affect other parts of your app.
ja: このメソッドを実装してください、もしあなたのインターフェイスオブジェクトへの変更があなたのアプリの他の部分に影響を与えるかもしれないならば。

source: Implement this method if changes to your view controller might affect other parts of your app.
ja: このメソッドを実装してください、もしあなたのビューコントローラへの変更があなたのアプリの他の部分に影響を与えるかもしれないならば。

source: Implement this method if changes to your view might affect other parts of your app.
ja: このメソッドを実装してください、もしあなたのビューへの変更があなたのアプリの他の部分に影響を与えるかもしれないならば。

source: Implement this method to conform to the Hashable protocol.
ja: このメソッドを実装して、Hashableプロトコルに準拠してください。

source: Implementing Buttons
ja: ボタンを実装する

source: Implementing View Modifiers
ja: ビュー修飾子を実装する

source: Implementing a Custom Gesture
ja: あつらえのジェスチャを実装する

source: Implementing a Custom View
ja: カスタムビューを実装する

source: Important
ja: 重要
